Revit 2026 API

# FluidTypeGetTemperature Method

---

Gets a copy of the FluidTemperature object matching a given temperature value.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FluidTemperature GetTemperature(
	double temperature
)
```
```vb
Public Function GetTemperature (
	temperature As Double
) As FluidTemperature
```
```cpp
public:
FluidTemperature^ GetTemperature(
	double temperature
)
```
```fsharp
member GetTemperature :
        temperature : float -> FluidTemperature
```

#### Parameters

temperature Double
     The temperature value.

#### Return Value

FluidTemperature The fluid temperature.  if not found.

Changes made to this object will not be applied to the FluidType object. In order to modify the FluidTemperature settings for a given temperature, you should remove the existing FluidTemperature (RemoveTemperature()) and then add the modified value (AddTemperature()).

#### Reference

FluidType Class

Autodesk.Revit.DB.Plumbing Namespace